### pandas

pandas is a powerful data manipulation library in python, widely used for data analysis and data cleaning. It provides two primary data structures. Series and DataFrame. A series is a one dimensional array like object, while data frame is a two dimensional, size-mutable, and potentially heterogenous tabulat data structures while labelled axes(rows and columns) 


what is pandas series ? 

It is a one dimensional array like objects  that can hold any data type. It is similar to a column in a table 

what is pandas dataframe ?

In [27]:
!pip install pandas

Requirement already satisfied: pandas in .\.venv\lib\site-packages (2.3.3)
Requirement already satisfied: numpy>=1.26.0 in .\.venv\lib\site-packages (from pandas) (2.3.5)
Requirement already satisfied: python-dateutil>=2.8.2 in .\.venv\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in .\.venv\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in .\.venv\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in .\.venv\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

In [28]:
import pandas as pd

In [29]:
### series 

data=[1,2,3,5]

serise=pd.Series(data) 
print("Series : \n",serise)

Series :
 0    1
1    2
2    3
3    5
dtype: int64

In [30]:
## create a series from dictionary elements 
print(type(serise))

<class 'pandas.core.series.Series'>

In [31]:
##create a series from dictionary 
data={
    'a':1 ,
    'b':2,
    'c':3,
    'd':4
    } 


series_dict=pd.Series(data) 
print(series_dict)

a    1
b    2
c    3
d    4
dtype: int64

In [32]:
data=[10,20,30] 
index=['a','b','c'] 

pd.Series(data,index=index)

a    10
b    20
c    30
dtype: int64

In [33]:
## dataframe

## create a dataframe from a dictionary of list 

data={
    'Name' :['rahul',"ramesh","krish","john"],
    'Age':[20,35,40,10],
    'City':["Banglore","new york","texas","chicago"]
} 


dataFrame=pd.DataFrame(data)
dataFrame

     Name  Age      City
0   rahul   20  Banglore
1  ramesh   35  new york
2   krish   40     texas
3    john   10   chicago

In [34]:
type(dataFrame)

pandas.core.frame.DataFrame

In [35]:
import numpy as np 
temp=np.array(dataFrame) 
temp

array([['rahul', 20, 'Banglore'],
       ['ramesh', 35, 'new york'],
       ['krish', 40, 'texas'],
       ['john', 10, 'chicago']], dtype=object)

In [36]:
temp.shape

(4, 3)

In [37]:
##create a data frame a list of dictonaries 

data=[
    {'Name': 'rahul',  'Age': 20, 'City': 'Banglore'},
    {'Name': 'ramesh', 'Age': 35, 'City': 'new york'},
    {'Name': 'krish',  'Age': 40, 'City': 'texas'},
    {'Name': 'john',   'Age': 10, 'City': 'chicago'}
]

In [38]:
df=pd.DataFrame(data) 
df

     Name  Age      City
0   rahul   20  Banglore
1  ramesh   35  new york
2   krish   40     texas
3    john   10   chicago

In [39]:
df=pd.read_csv('sales_data.csv')

In [40]:
## too see top 5 rows 
df.head()

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal

In [41]:
## to see last 5 records 
df.tail()

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
235,10236,2024-08-23,Home Appliances,Nespresso Vertuo Next Coffee and Espresso Maker,1,159.99,159.99,Europe,PayPal
236,10237,2024-08-24,Clothing,Nike Air Force 1 Sneakers,3,90.00,270.00,Asia,Debit Card
237,10238,2024-08-25,Books,The Handmaid's Tale by Margaret Atwood,3,10.99,32.97,North America,Credit Card
238,10239,2024-08-26,Beauty Products,Sunday Riley Luna Sleeping Night Oil,1,55.00,55.00,Europe,PayPal
239,10240,2024-08-27,Sports,Yeti Rambler 20 oz Tumbler,2,29.99,59.98,Asia,Credit Card

In [42]:
## accessing data from dataFrame 

df

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal
...,...,...,...,...,...,...,...,...,...
235,10236,2024-08-23,Home Appliances,Nespresso Vertuo Next Coffee and Espresso Maker,1,159.99,159.99,Europe,PayPal
236,10237,2024-08-24,Clothing,Nike Air Force 1 Sneakers,3,90.00,270.00,Asia,Debit Card
237,10238,2024-08-25,Books,The Handmaid's Tale by Margaret Atwood,3,10.99,32.97,North America,Credit Card
238,10239,2024-08-26,Beauty Products,Sunday Riley Luna Sleeping Night Oil,1,55.00,55.00,Europe,PayPal
239,10240,2024-08-27,Sports,Yeti Rambler 20 oz Tumbler,2,29.99,59.98,Asia,Credit Card

In [43]:
df=pd.DataFrame(data)
df

     Name  Age      City
0   rahul   20  Banglore
1  ramesh   35  new york
2   krish   40     texas
3    john   10   chicago

In [44]:
type(df['Name']) ## it becomes series

pandas.core.series.Series

In [45]:
df.loc[0]  ## row index

Name       rahul
Age           20
City    Banglore
Name: 0, dtype: object

In [46]:
df.iloc[0][2]

C:\Users\rahul\AppData\Local\Temp\ipykernel_19816\2519637664.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[0][2]

'Banglore'

In [47]:
### ACCESSING  specified a element 

df['Name']

0     rahul
1    ramesh
2     krish
3      john
Name: Name, dtype: object

In [48]:
df

     Name  Age      City
0   rahul   20  Banglore
1  ramesh   35  new york
2   krish   40     texas
3    john   10   chicago

In [49]:
df.at[1,'Age']

np.int64(35)

In [50]:
df.at[3,'City']

'chicago'

In [51]:
## accessing a specified element using iat 

df.iat[2,2]

'texas'

In [55]:
## adding a column
df['Salary']=[50000,60000,70000,80000]
df

     Name  Age      City  Salary
0   rahul   20  Banglore   50000
1  ramesh   35  new york   60000
2   krish   40     texas   70000
3    john   10   chicago   80000

In [ ]:
## removing a column temporary
## axis to check it is column other wise it will think it is row
df.drop('Salary',axis=1)

     Name  Age      City
0   rahul   20  Banglore
1  ramesh   35  new york
2   krish   40     texas
3    john   10   chicago

In [57]:
df

     Name  Age      City  Salary
0   rahul   20  Banglore   50000
1  ramesh   35  new york   60000
2   krish   40     texas   70000
3    john   10   chicago   80000

In [58]:
## removing a column permanently
df.drop('Salary',axis=1,inplace=True)

In [ ]:
## adding a number to existing data 
df['Age']=df['Age']+1

In [61]:
df

     Name  Age      City
0   rahul   21  Banglore
1  ramesh   36  new york
2   krish   41     texas
3    john   11   chicago

In [62]:
## droping  a row 
df.drop(0)

     Name  Age      City
1  ramesh   36  new york
2   krish   41     texas
3    john   11   chicago

In [63]:
df

     Name  Age      City
0   rahul   21  Banglore
1  ramesh   36  new york
2   krish   41     texas
3    john   11   chicago

In [64]:
df.drop(0,inplace=True)

In [65]:
df

     Name  Age      City
1  ramesh   36  new york
2   krish   41     texas
3    john   11   chicago

In [67]:
## to display the statstical summary

print("Statastical summary : ",df.describe())

Statastical summary :               Age
count   3.000000
mean   29.333333
std    16.072751
min    11.000000
25%    23.500000
50%    36.000000
75%    38.500000
max    41.000000

In [68]:
df.describe()

             Age
count   3.000000
mean   29.333333
std    16.072751
min    11.000000
25%    23.500000
50%    36.000000
75%    38.500000
max    41.000000